build/classes/com/tilab/wsig/examples/xml/MathFunctions-testPrintComplex.xml

<?xml version="1.0" encoding="UTF-8" ?> 
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:MathFunctions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:printComplex soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <complex xsi:type="urn:complex">
            <real xsi:type="xsd:float">1</real>
            <immaginary xsi:type="xsd:float">2</immaginary>
         </complex>
      </urn:printComplex>
   </soapenv:Body>
</soapenv:Envelope>